In [1]:
import numpy as np
import pandas as pd

In [2]:
def findDistance(loc1, loc2, radius = 6378, height = 0):
    lat1, long1 = loc1
    lat2, long2 = loc2
    #conversion of unit from degree to radian
    lat1 *= pi/180
    long1 *= pi/180
    lat2 *= pi/180
    long2 *= pi/180
    # radius, height, and result in kilometers
    return (radius + height)*acos(sin(lat1)*sin(lat2) + cos(lat1)*cos(lat2)*cos(long1 - long2))

In [3]:
countryDetail_df = pd.read_csv("./data/capitalCities.csv")
countryDetail_df.head()

  Code              City      Country  Latitude  Longitude
0  ABW        Oranjestad        Aruba   12.5304   -70.0290
1  AFG             Kabul  Afghanistan   34.5167    69.1833
2  AGO            Luanda       Angola   -8.8383    13.2344
3  ALB            Tirana      Albania   41.3275    19.8189
4  AND  Andorra la Vella      Andorra   42.5000     1.5165

In [4]:
countryDetail_df = countryDetail_df[['Code', 'Country', 'City', 'Latitude', 'Longitude']]
countryDetail_df.head()

  Code      Country              City  Latitude  Longitude
0  ABW        Aruba        Oranjestad   12.5304   -70.0290
1  AFG  Afghanistan             Kabul   34.5167    69.1833
2  AGO       Angola            Luanda   -8.8383    13.2344
3  ALB      Albania            Tirana   41.3275    19.8189
4  AND      Andorra  Andorra la Vella   42.5000     1.5165

In [5]:
population_df = pd.read_csv("./data/population.csv")
population_df.head()

  Country Code  Year  Population
0   Aruba  ABW  2008      101000
1   Aruba  ABW  2009      101000
2   Aruba  ABW  2010      102000
3   Aruba  ABW  2011      102000
4   Aruba  ABW  2012      103000

In [6]:
dummy = pd.get_dummies(population_df['Year'])
dummy.head()

   2008  2009  2010  2011  2012  2013  2014  2015  2016  2017  2018  2019
0     1     0     0     0     0     0     0     0     0     0     0     0
1     0     1     0     0     0     0     0     0     0     0     0     0
2     0     0     1     0     0     0     0     0     0     0     0     0
3     0     0     0     1     0     0     0     0     0     0     0     0
4     0     0     0     0     1     0     0     0     0     0     0     0

In [7]:
population_df = pd.concat([population_df,dummy],axis=1)
population_df.head()

,Country,Code,Year,Population,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Aruba,ABW,2008,101000,1,0,0,0,0,0,0,0,0,0,0,0
1,Aruba,ABW,2009,101000,0,1,0,0,0,0,0,0,0,0,0,0
2,Aruba,ABW,2010,102000,0,0,1,0,0,0,0,0,0,0,0,0
3,Aruba,ABW,2011,102000,0,0,0,1,0,0,0,0,0,0,0,0
4,Aruba,ABW,2012,103000,0,0,0,0,1,0,0,0,0,0,0,0

In [8]:
for i in range(2008, 2020):
    population_df[i] *= population_df['Population']

population_df.head()

,Country,Code,Year,Population,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Aruba,ABW,2008,101000,101000,0,0,0,0,0,0,0,0,0,0,0
1,Aruba,ABW,2009,101000,0,101000,0,0,0,0,0,0,0,0,0,0
2,Aruba,ABW,2010,102000,0,0,102000,0,0,0,0,0,0,0,0,0
3,Aruba,ABW,2011,102000,0,0,0,102000,0,0,0,0,0,0,0,0
4,Aruba,ABW,2012,103000,0,0,0,0,103000,0,0,0,0,0,0,0

In [9]:
new_df = population_df.groupby('Code').sum().drop(['Year', 'Population'], axis=1)

In [10]:
countryPopulation_df = pd.merge(countryDetail_df, new_df, how='inner', on='Code')
countryPopulation_df.head()

,Code,Country,City,Latitude,Longitude,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,ABW,Aruba,Oranjestad,12.5304,-70.0290,101000,101000,102000,102000,103000,103000,104000,104000,105000,105000,106000,106000
1,AFG,Afghanistan,Kabul,34.5167,69.1833,27722000,28395000,29186000,30117000,31161000,32270000,33371000,34414000,35383000,36296000,37172000,38042000
2,AGO,Angola,Luanda,-8.8383,13.2344,21696000,22514000,23356000,24221000,25108000,26016000,26942000,27884000,28842000,29817000,30810000,31825000
3,ALB,Albania,Tirana,41.3275,19.8189,3003000,2973000,2948000,2929000,2914000,2904000,2896000,2891000,2886000,2884000,2883000,2881000
4,AND,Andorra,Andorra la Vella,42.5000,1.5165,84000,84000,84000,84000,82000,81000,79000,78000,77000,77000,77000,77000